#+TITLE: SICP
#+AUTHOR: 147Pm
#+EMAIL: borgauf@sdf.org
#+DATE: 2017-02-08T14:26:12
#+Filetags: :SICP
#+LANGUAGE:  en
# #+INFOJS_OPT: view:showall ltoc:t mouse:underline path:http://orgmode.org/org-info.js
#+HTML_HEAD: <link rel="stylesheet" href="../../data/stylesheet.css" type="text/css">
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+OPTIONS: H:15 num:15 toc:nil \n:nil @:t ::t |:t _:{} *:t ^:{} prop:t
#+OPTIONS: prop:t
# This makes MathJax not work
# #+OPTIONS: tex:imagemagick
# this makes MathJax work
#+OPTIONS: tex:t
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [american]
# Setup tikz package for both LaTeX and HTML export:
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usepackage{commath}
#+LaTeX_HEADER: \usepackage{pgfplots}
#+LaTeX_HEADER: \usepackage{sansmath}
#+LaTeX_HEADER: \usepackage{mathtools}
# #+HTML_MATHJAX: align: left indent: 5em tagside: left font: Neo-Euler
#+PROPERTY: header-args:latex+ :packages '(("" "tikz"))
#
#+PROPERTY: header-args:latex+ :exports results :fit yes
#
#+STARTUP: showall
#+STARTUP: align
#+STARTUP: indent
#+STARTUP: entitiespretty
#+STARTUP: logdrawer

*** 1.1.8 Procedures as Black-Box Abstractions

#+name:double
#+begin_src scheme :session mainsession :exports both :tangle yes :cache yes :results silent
(define (double x) (+ x x))
#+end_src

This uses ~(exp z)~ (Euler’s raised to ~z~) and ~log z~ (natural log of ~z~) and often produces “ragged” real numbers:

#+name:elsquare
#+begin_src scheme :session mainsession :exports both :tangle yes :cache yes :results silent
(define (elsquare x)
  (exp (double (log x))))
#+end_src

Use ~round~ to correct:

#+begin_src scheme :session mainsession
(elsquare 5)
(round (elsquare 5))
#+end_src

#+RESULTS:
: 25.0

*** 1.2.1 Linear Recursion and Iteration

Factorial is $n! = n \cdot (n - 1)! = n \cdot [(n−1) \cdot (n−2) \cdots 3⋅2⋅1]$

#+name:fact1
#+begin_src scheme :session mainsession :exports both :tangle yes :cache yes :results silent
(define (fact1 n)
  (if (= n 1) 
      1 
      (* n (fact1 (- n 1)))))
#+end_src

#+name:trace-fact1
#+begin_src scheme :session mainsession :exports both :tangle yes :cache yes
(require racket/trace)
(trace fact1)
(fact1 6)
#+end_src

#+RESULTS[dc04c2377d83b2631a2f5b8d21a8010f30572abc]: trace-fact1
: 720

#+BEGIN_EXAMPLE
>(fact1 6)
> (fact1 5)
> >(fact1 4)
> > (fact1 3)
> > >(fact1 2)
> > > (fact1 1)
< < < 1
< < <2
< < 6
< <24
< 120
<720
#+END_EXAMPLE

#+name:fact2
#+begin_src scheme :session mainsession :exports both :tangle yes :cache yes :results silent
(define (fact2 n)
  (if (or (= n 1) (= n 0))
      1 
      (* n (fact2 (- n 1)))))
#+end_src

#+name:fact-nl
#+begin_src scheme :session mainsession :exports both :tangle yes :cache yes :results silent
(define (fact-nl n)
  (let factorial-impl ((n n) (t 1))
      (if (eq? n 0)
        t
        (factorial-impl (- n 1) (* t n)))))
#+end_src

**** Exercise 1.9

#+name:rec+
#+begin_src scheme :session mainsession :exports both :tangle yes :cache yes :results silent
(define (rec+ a b)
  (if (= a 0)
      b
      (add1 (rec+ (sub1 a) b))))
#+end_src

#+name:iter+
#+begin_src scheme :session mainsession :exports both :tangle yes :cache yes :results silent
(define (iter+ a b)
  (if (= a 0)
      b
      (iter+ (sub1 a) (add1 b))))
#+end_src

#+name:trace-rec+
#+begin_src scheme :session mainsession :exports both :tangle yes :cache yes
(require racket/trace)
(trace rec+)
(rec+ 4 5)
#+end_src

#+RESULTS[ed4c346e15786c2ea6d3ba9ca60c9236fbee1020]: trace-rec+
: 9

#+BEGIN_SRC scheme
>(rec+ 4 5)
> (rec+ 3 5)
> >(rec+ 2 5)
> > (rec+ 1 5)
> > >(rec+ 0 5)
< < <5
< < 6
< <7
< 8
<9
9
#+END_SRC

**** Exercise 1.10

#+name: Ackermann
#+begin_src scheme :session mainsession :exports both :tangle yes :cache yes :results silent
(define (Ackermann x y)
  (cond ((= y 0) 0)
        ((= x 0) (* 2 y))
        ((= y 1) 2)
        (else (Ackermann (- x 1) (Ackermann x (- y 1))))))
#+end_src

#+name: Ackermann-test-1
#+begin_src scheme :session mainsession :exports both :tangle yes :cache yes
(require racket/trace)
(trace Ackermann)
(Ackermann 1 10)
#+end_src

#+RESULTS[6c8b071b5380179f2b3e39721c510038581454bd]: Ackermann-test-1
: 1024


Trace of (Ackermann 1 10):
#+BEGIN_EXAMPLE
>(Ackermann 1 10)
> (Ackermann 1 9)
> >(Ackermann 1 8)
> > (Ackermann 1 7)
> > >(Ackermann 1 6)
> > > (Ackermann 1 5)
> > > >(Ackermann 1 4)
> > > > (Ackermann 1 3)
> > > > >(Ackermann 1 2)
> > > > > (Ackermann 1 1)
< < < < < 2
> > > > >(Ackermann 0 2)
< < < < <4
> > > > (Ackermann 0 4)
< < < < 8
> > > >(Ackermann 0 8)
< < < <16
> > > (Ackermann 0 16)
< < < 32
> > >(Ackermann 0 32)
< < <64
> > (Ackermann 0 64)
< < 128
> >(Ackermann 0 128)
< <256
> (Ackermann 0 256)
< 512
>(Ackermann 0 512)
<1024
#+END_EXAMPLE

#+name: Ackermann-fixed
#+begin_src scheme :session mainsession :exports both :tangle yes :cache yes :results silent
(define (Af n) (Ackermann 0 n))
(define (Ag n) (Ackermann 1 n))
(define (Ah n) (Ackermann 2 n))
(define (k n) (* 5 n n)) 
#+end_src

- ~(Af n)~ $\rightarrow 2n \cdots$ e.g. ~(Af 10)~ $\rightarrow$ ~20~ $\rightarrow 2n$
- ~(Ag n)~ $\rightarrow 2^n$
- ~(Ah n)~ $\rightarrow 2^{2^{2}} \cdots (n-1)$ times


*** 1.2.2 Tree Recursion

Fibonacci numbers:

\begin{align}
Fib(n) = \left\{ \begin{array}{ll}
0 & if \ n = 0,\\
1 & if \, n = 1,\\
Fib(n - 1)  +  Fib(n - 2) & otherwise. \end{array} \right.
\end{align}

translates to this code:

#+name: fib1
#+begin_src scheme :session mainsession :exports both :tangle yes :cache yes :results silent
(define (fib n)
  (cond ((= n 0) 0)
        ((= n 1) 1)
        (else (+ (fib (- n 1))
                 (fib (- n 2))))))
#+end_src

#+name: fib1-test
#+begin_src scheme :session mainsession :exports both :tangle yes :cache yes
(require racket/trace)
(trace fib)
(fib 5)
#+end_src

#+RESULTS[7782b33befbf3b0b94a815328c2ea82b0bf15897]: fib1-test
: 5

However, this is terribly inefficient. From this trace:

#+BEGIN_EXAMPLE
>(fib 5)
> (fib 4)
> >(fib 3)
> > (fib 2)
> > >(fib 1)
< < <1
> > >(fib 0)
< < <0
< < 1
> > (fib 1)
< < 1
< <2
> >(fib 2)
> > (fib 1)
< < 1
> > (fib 0)
< < 0
< <1
< 3
> (fib 3)
> >(fib 2)
> > (fib 1)
< < 1
> > (fib 0)
< < 0
< <1
> >(fib 1)
< <1
< 2
<5
#+END_EXAMPLE

we see that ~(fib 3)~ is done twice.

**** Exercise 1.14 ~count-change~

What are the orders of growth of the space and number of steps used by the process below as the amount to be changed increases?

#+name:count-change
#+begin_src scheme :session mainsession :exports both :tangle yes :cache yes :results silent
(define (count-change amount)
  (cc amount 5))

(define (cc amount kinds-of-coins)
  (cond ((= amount 0) 1)
        ((or (< amount 0) 
             (= kinds-of-coins 0)) 
         0)
        (else 
         (+ (cc amount (- kinds-of-coins 1))
            (cc (- amount (first-denomination 
                           kinds-of-coins))
                kinds-of-coins)))))

(define (first-denomination kinds-of-coins)
  (cond ((= kinds-of-coins 1) 1)
        ((= kinds-of-coins 2) 5)
        ((= kinds-of-coins 3) 10)
        ((= kinds-of-coins 4) 25)
        ((= kinds-of-coins 5) 50)))
#+end_src

#+BEGIN_EXAMPLE
(count-change 11)
|
(cc 11 5)__
|          \
(cc 11 4)   (cc -39 5)
|       \___
|           \
(cc 11 3)   (cc -14 4)
|       \_______________________________________________________
|                                                               \
(cc 11 2)                                                      (cc 1 3)
|       \_________________________                              |     \__
|                                 \                             |        \
(cc 11 1)                        (cc 6 2)                      (cc 1 2) (cc -9 2)
|       \___                      |     \__                     |     \__
|           \                     |        \                    |        \
(cc 11 0)   (cc 10 1)            (cc 6 1) (cc 1 2)             (cc 1 1) (cc -4 2)
         __/ |                 __/ |       |     \__            |     \__
        /    |                /    |       |        \           |        \
(cc 10 0)   (cc 9 1)  (cc 6 0)   (cc 5 1) (cc 1 1) (cc -4 2)   (cc 1 0) (cc 0 1)
         __/ |                 __/ |       |     \__
        /    |                /    |       |        \
(cc 9 0)    (cc 8 1)  (cc 5 0)   (cc 4 1) (cc 1 0) (cc 0 1)
         __/ |                 __/ |
        /    |                /    |
(cc 8 0)    (cc 7 1)  (cc 4 0)   (cc 3 1)
         __/ |                 __/ |
        /    |                /    |
(cc 7 0)    (cc 6 1)  (cc 3 0)   (cc 2 1)
         __/ |                 __/ |
        /    |                /    |
(cc 6 0)    (cc 5 1)  (cc 2 0)   (cc 1 1)
         __/ |                 __/ |
        /    |                /    |
(cc 5 0)    (cc 4 1)  (cc 1 0)   (cc 0 1)
         __/ |
        /    |
(cc 4 0)    (cc 3 1)
         __/ |
        /    |
(cc 3 0)    (cc 2 1)
         __/ |
        /    |
(cc 2 0)    (cc 1 1)
         __/ |
        /    |
(cc 1 0)    (cc 0 1)
#+END_EXAMPLE

#+begin_src scheme :session mainsession
(count-change 11)
#+end_src

#+RESULTS:
: 4

$\rightarrow$ ...count up the ~(cc 1 0)~ leaves in the above tree. They each become $1$ (see code above).

**** Don't make this mistake:

#+name:make-point-bad
#+begin_src scheme :session mainsession :exports both :tangle yes :cache yes :results silent
(define (make-point-bad x y z)
  '(x y z))
#+end_src

#+name:make-point-bad-test1
#+begin_src scheme :session mainsession :exports both :tangle yes :cache yes
(make-point-bad 1 2 3)
#+end_src

#+RESULTS[c2ae073e714f86d1b3bdf75bdc47fe2b6011b5f2]: make-point-bad-test1
: (x y z)

...when you really want

#+name:make-point-good
#+begin_src scheme :session mainsession :exports both :tangle yes :cache yes :results silent
(define (make-point-good x y z)
  (list x y z))
#+end_src

#+name:(make-point-good-test1
#+begin_src scheme :session mainsession :exports both :tangle yes :cache yes
(make-point-good 1 2 3)
#+end_src

#+RESULTS[923682870477c1dd4a80b4d6504e3ad50c228466]: (make-point-good-test1
: (1 2 3)

...which /constructs/ a list out of the input parameters.

#+name:
#+begin_src scheme :session mainsession :exports both :tangle yes :cache yes :results silent

#+end_src

